'''
1065번: 한수 / silver 4 / 브루트포스
'''
# 1. 입력 받기
x = int(input())
# 2. 1000까지 한수
double_digit = [i for i in range(1, 100)]
three_digit = [111,123,135,147,159,210,222,234,246,258,321,333,345,357,369,432,420,444,456,468,543,531,555,567,579,654,642,630,666,678,765,753,741,777,789,888,876,864,852,840,999,987,975,963,951]
# 3. 한수 리스트 합치기 + 오름차순 정렬
digit = double_digit + three_digit
digit.sort()
# 4. x보다 작거나 같은 한수 개수 세기
cnt = 0
for v in digit:
    if v <= x:
        cnt += 1
    else:
        break
print(cnt)
